Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [8]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2020-01-15 13:22:21--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.217.42.6
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.217.42.6|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  16.7MB/s    in 13s

2020-01-15 13:22:35 (14.7 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [9]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [10]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01/instacart_2017_05_01

In [11]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [0]:
##### YOUR CODE HERE #####
import pandas as pd
first = pd.read_csv('order_products__prior.csv')
second = pd.read_csv('order_products__train.csv')
order_prod_df = pd.concat([first, second])

In [15]:
order_prod_df

         order_id  product_id  add_to_cart_order  reordered
0               2       33120                  1          1
1               2       28985                  2          1
2               2        9327                  3          0
3               2       45918                  4          1
4               2       30035                  5          0
...           ...         ...                ...        ...
1384612   3421063       14233                  3          1
1384613   3421063       35548                  4          1
1384614   3421070       35951                  1          1
1384615   3421070       16953                  2          1
1384616   3421070        4724                  3          1

[33819106 rows x 4 columns]

In [0]:
products_df = pd.read_csv('products.csv')
top10_names = ['Banana','Bag of Organic Bananas','Organic Strawberries',
            'Organic Baby Spinach','Organic Hass Avocado','Organic Avocado',
            'Large Lemon','Strawberries','Limes','Organic Whole Milk']

In [8]:
top_prods_df = products_df[[p in top10_names for p in products_df['product_name']]]
top_prods_df

       product_id            product_name  aisle_id  department_id
13175       13176  Bag of Organic Bananas        24              4
16796       16797            Strawberries        24              4
21136       21137    Organic Strawberries        24              4
21902       21903    Organic Baby Spinach       123              4
24851       24852                  Banana        24              4
26208       26209                   Limes        24              4
27844       27845      Organic Whole Milk        84             16
47208       47209    Organic Hass Avocado        24              4
47625       47626             Large Lemon        24              4
47765       47766         Organic Avocado        24              4

In [9]:
df = order_prod_df[order_prod_df.product_id.isin(top_prods_df.product_id)]
df

         order_id  product_id  add_to_cart_order  reordered
12              3       21903                  4          1
30              5       13176                  1          1
51              5       47209                 22          0
77             10       24852                  1          1
80             10       47766                  4          1
...           ...         ...                ...        ...
1384519   3420895       47626                  6          1
1384538   3420909       21137                  9          1
1384546   3420996       24852                  1          1
1384561   3420998       21137                  5          1
1384563   3420998       21903                  7          1

[2418314 rows x 4 columns]

In [10]:
len(df['product_id'].unique())

10

In [11]:
df = pd.merge(df, top_prods_df, how='left')
df

         order_id  product_id  ...  aisle_id  department_id
0               3       21903  ...       123              4
1               5       13176  ...        24              4
2               5       47209  ...        24              4
3              10       24852  ...        24              4
4              10       47766  ...        24              4
...           ...         ...  ...       ...            ...
2418309   3420895       47626  ...        24              4
2418310   3420909       21137  ...        24              4
2418311   3420996       24852  ...        24              4
2418312   3420998       21137  ...        24              4
2418313   3420998       21903  ...       123              4

[2418314 rows x 7 columns]

In [12]:
df['product_name'].value_counts()

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [13]:
import pandas as pd
import numpy as np

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T
print(table1)
table2

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [14]:
# table2 -> tidy
tidy = pd.pivot_table(table2, columns = table2.index)
tidy

              treatmenta  treatmentb
Jane Doe            16.0        11.0
John Smith           NaN         2.0
Mary Johnson         3.0         1.0

In [15]:
# tidy -> table2
pd.pivot_table(tidy, columns=tidy.index)

            Jane Doe  John Smith  Mary Johnson
treatmenta      16.0         NaN           3.0
treatmentb      11.0         2.0           1.0

In [16]:
import seaborn as sns
flights = sns.load_dataset('flights')
flights

     year      month  passengers
0    1949    January         112
1    1949   February         118
2    1949      March         132
3    1949      April         129
4    1949        May         121
..    ...        ...         ...
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

[144 rows x 3 columns]

In [17]:
pd.pivot_table(flights, columns=flights[['month','year']])

            month     year
passengers  January   1949    112
                      1950    115
                      1951    145
                      1952    171
                      1953    196
                             ...
            December  1956    306
                      1957    336
                      1958    337
                      1959    405
                      1960    432
Length: 144, dtype: int64

In [0]:
# Flights Pivot Table

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [38]:
##### YOUR CODE HERE #####
'''Merge orders_df and order_prod_df to form a df that includes
   order_hour_of_day, and product_id'''
orders_df = pd.read_csv('orders.csv')
orders_df = orders_df[['order_id', 'order_hour_of_day']]
df = pd.merge(orders_df, order_prod_df, how='left')
df

          order_id  order_hour_of_day  product_id  add_to_cart_order  reordered
0          2539329                  8       196.0                1.0        0.0
1          2539329                  8     14084.0                2.0        0.0
2          2539329                  8     12427.0                3.0        0.0
3          2539329                  8     26088.0                4.0        0.0
4          2539329                  8     26405.0                5.0        0.0
...            ...                ...         ...                ...        ...
33894101    272231                 14     40603.0                4.0        0.0
33894102    272231                 14     15655.0                5.0        0.0
33894103    272231                 14     42606.0                6.0        0.0
33894104    272231                 14     37966.0                7.0        0.0
33894105    272231                 14     39216.0                8.0        1.0

[33894106 rows x 5 columns]

In [0]:
'''Filter out late day purchases'''
late_day_purchases_df = df[df['order_hour_of_day']>12]

In [40]:
products_df = pd.read_csv('products.csv')[['product_name', 'product_id']]
df = pd.merge(late_day_purchases_df, products_df, how='left')
df

          order_id  ...                            product_name
0           431534  ...                                    Soda
1           431534  ...                     Original Beef Jerky
2           431534  ...                              Pistachios
3           431534  ...                   Organic String Cheese
4           431534  ...                     Organic Fuji Apples
...            ...  ...                                     ...
19210804    272231  ...                  Fabric Softener Sheets
19210805    272231  ...  Dark Chocolate Mint Snacking Chocolate
19210806    272231  ...                Phish Food Frozen Yogurt
19210807    272231  ...                   French Baguette Bread
19210808    272231  ...    Original Multigrain Spoonfuls Cereal

[19210809 rows x 6 columns]

In [41]:
df['product_name'].value_counts()[:25]

Banana                      275720
Bag of Organic Bananas      221476
Organic Strawberries        157296
Organic Baby Spinach        143816
Organic Hass Avocado        126847
Organic Avocado             106522
Large Lemon                  90751
Limes                        84053
Strawberries                 82881
Organic Whole Milk           80125
Organic Raspberries          79601
Organic Yellow Onion         66821
Organic Garlic               65612
Organic Zucchini             62881
Organic Blueberries          59432
Cucumber Kirby               57974
Organic Lemon                52313
Organic Grape Tomatoes       51014
Organic Fuji Apple           50205
Organic Cucumber             49145
Apple Honeycrisp Organic     48111
Seedless Red Grapes          48068
Honeycrisp Apple             46281
Organic Baby Carrots         44692
Yellow Onions                44090
Name: product_name, dtype: int64

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####